In [1]:
library(rio)

In [52]:
# CSV

rio_csv <- import('CourseFiles/ImportingData_Datasets/mbb.csv')
head(rio_csv)

r_csv <- read.csv('CourseFiles/ImportingData_Datasets/mbb.csv', header = TRUE)
head(r_csv)

  Month   Mozart Beethoven Bach
1 2004-01 12     8         15
2 2004-02 12     9         15
3 2004-03 12     9         14
4 2004-04 12     8         14
5 2004-05 11     9         13
6 2004-06  9     7         12

  Month   Mozart Beethoven Bach
1 2004-01 12     8         15
2 2004-02 12     9         15
3 2004-03 12     9         14
4 2004-04 12     8         14
5 2004-05 11     9         13
6 2004-06  9     7         12

In [49]:
# TXT

rio_txt <- import('CourseFiles/ImportingData_Datasets/mbb.txt')
head(rio_txt)

r_txt <- read.table('CourseFiles/ImportingData_Datasets/mbb.txt', header = T, sep = '\t')
head(r_txt)

  Month   Mozart Beethoven Bach
1 2004-01 12     8         15
2 2004-02 12     9         15
3 2004-03 12     9         14
4 2004-04 12     8         14
5 2004-05 11     9         13
6 2004-06  9     7         12

  Month   Mozart Beethoven Bach
1 2004-01 12     8         15
2 2004-02 12     9         15
3 2004-03 12     9         14
4 2004-04 12     8         14
5 2004-05 11     9         13
6 2004-06  9     7         12

In [33]:
# XLSX

rio_xlsx <- import('CourseFiles/ImportingData_Datasets/mbb.xlsx')
head(rio_xlsx)

  Month   Mozart Beethoven Bach
1 2004-01 12     8         15
2 2004-02 12     9         15
3 2004-03 12     9         14
4 2004-04 12     8         14
5 2004-05 11     9         13
6 2004-06  9     7         12

In [53]:
rio_csv[order(-rio_csv$Mozart), ][1:5, ]

   Month   Mozart Beethoven Bach
25 2006-01 100    7         13
26 2006-02  25    7         12
27 2006-03  19    7         14
29 2006-05  15    7         12
28 2006-04  14    6         12

In [69]:
mtcars[c(1:3), c(1:3, 5:9)]

              mpg  cyl disp drat wt    qsec  vs am
Mazda RX4     21.0 6   160  3.90 2.620 16.46 0  1
Mazda RX4 Wag 21.0 6   160  3.90 2.875 17.02 0  1
Datsun 710    22.8 4   108  3.85 2.320 18.61 1  1